Question1
Answer1:

 here are five functions of the pandas library with execution:
 
 ->read_csv():This function reads a comma-separated values (CSV) file into a DataFrame.

In [6]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [8]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

->to_csv():This function writes a DataFrame to a CSV file.

In [9]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
df.to_csv('student.csv')

->describe():This function provides a summary of a DataFrame, including the number of rows, columns, and the mean, standard deviation,
minimum, and maximum values for each column.

In [10]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

->filter():This function selects rows from a DataFrame that meet certain criteria.

In [11]:
df = df[df['Fare'] > 50]

In [12]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
...,...,...,...,...,...,...,...,...,...,...,...,...
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C

->groupby():This function groups rows in a DataFrame together based on a common value and then performs an operation on each group.

In [13]:
grouped_df = df.groupby('Fare')

average_values = grouped_df['Fare'].mean()

print(average_values)

Fare
50.4958      50.4958
51.4792      51.4792
51.8625      51.8625
52.0000      52.0000
52.5542      52.5542
              ...
227.5250    227.5250
247.5208    247.5208
262.3750    262.3750
263.0000    263.0000
512.3292    512.3292
Name: Fare, Length: 64, dtype: float64

Question2
Answer2

In [17]:
def reindex_df(df):
    new_index = list(range(1, len(df) * 2, 2))
    df.index = new_index
    return df


df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

reindexed_df = reindex_df(df)

print(reindexed_df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

Question3
Answer3:

In [18]:
def sum_first_three_values(df):
    first_three_values = df['Values'].head(3).sum()
    print(first_three_values)


df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})

sum_first_three_values(df)

60

Question4
Answer4:

In [20]:
def create_word_count_column(df):
    df['Word_Count'] = df['Text'].str.split().str.len()
    return df


df = pd.DataFrame({'Text': ['This is a number1.', 'This is another number2.', 'This is a third number3.']})

df = create_word_count_column(df)

print(df)

                       Text  Word_Count
0        This is a number1.           4
1  This is another number2.           4
2  This is a third number3.           5

Question5
Answer5:

->The DataFrame.size() and DataFrame.shape() attributes in pandas are both used to get the number of elements in a DataFrame. However, they
do so in different ways.

->DataFrame.size() returns the total number of elements in the DataFrame, which is calculated by multiplying the number of rows by the 
number of columns. For example, if a DataFrame has 3 rows and 4 columns, then DataFrame.size() will return 12.

->DataFrame.shape() returns a tuple that represents the dimensions of the DataFrame. The first element of the tuple is the number of rows, 
and the second element is the number of columns. For example, if a DataFrame has 3 rows and 4 columns, then DataFrame.shape() will return 
the tuple (3, 4).

->In other words, DataFrame.size() returns the total number of elements in the DataFrame, while DataFrame.shape() returns the number of 
rows and columns in the DataFrame.

In [21]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})

print(df.size)


print(df.shape)

9
(3, 3)

Question6
Answer6:

->The read_excel() function in pandas is used to read an Excel file. It takes the path to the Excel file as its first argument, and it can 
also take other arguments, such as the sheet name to read, the index column, and the dtypes of the columns.

Question7
Answer7:

In [22]:
def create_username_column(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df


df = pd.DataFrame({'Email': ['shubham@gmail.com', 'tiwari@gmail.com', 'pandey@gmail.com']})

df = create_username_column(df)

print(df)

               Email Username
0  shubham@gmail.com  shubham
1   tiwari@gmail.com   tiwari
2   pandey@gmail.com   pandey

Question8
Answer8:

In [29]:
import pandas as pd

df = pd.DataFrame({'A':[3,8,6,2,9], 'B':[5,2,9,3,1],'C':[1,7,4,5,2]})

df[(df['A']>5) & (df['B']<10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Question9
Answer9:

In [34]:
def calculate_statistics(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()

df = pd.DataFrame({'Values': [1, 2, 3, 4, 5]})
print(mean, median, std)

3.0 3.0 1.5811388300841898

Question10
Answer10:

In [46]:
def calculate_moving_average(df):
    rolling_mean = df['Sales'].rolling(7).mean()
    df['MovingAverage'] = rolling_mean
    return df


df = pd.DataFrame({'Sales': [4, 23, 34, 56, 78, 83, 96], 'Date': ['2023-01-10', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05', '2023-01-06', '2023-01-07']})

df = calculate_moving_average(df)

print(df)

   Sales        Date  MovingAverage
0      4  2023-01-10            NaN
1     23  2023-01-02            NaN
2     34  2023-01-03            NaN
3     56  2023-01-04            NaN
4     78  2023-01-05            NaN
5     83  2023-01-06            NaN
6     96  2023-01-07      53.428571

Question11
Answer11:

In [49]:
import datetime

def create_weekday_column(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df


df = pd.DataFrame({'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05'])})

df = create_weekday_column(df)

print(df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Question12
Answer12:

In [57]:
import datetime
df = pd.DataFrame({'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-02-01', '2023-01-31'])})

def select_dates(df):
    return df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]

filtered_df = select_dates(df)
print(filtered_df)

        Date
0 2023-01-01
1 2023-01-02
3 2023-01-31

Question13
Answer13:

In [ ]:
import pandas as pd

->To use the basic functions of pandas, you need to import the pandas library.

->The pandas library provides a number of functions and methods for working with dataframes, series, and other data structures. It is a
powerful library that can be used for a variety of data analysis tasks.